<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 5 changes.</summary>

```diff
# tailscale_tailnet_key.tailscale_key has been deleted
+ tailscale_tailnet_key.tailscale_key will be created
! module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.vm_minimal_config.module.cloud_init_files.proxmox_virtual_environment_file.ci_user_data[0] must be replaced
! module.vm_minimal_config.module.cloud_init_files.random_id.random_id must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 3 to add, 2 to change, 2 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-11T03:51:57Z [(view log)](https://github.com/perchnet/p/actions/runs/16870467666/job/47784294418#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # tailscale_tailnet_key.tailscale_key has been deleted
  - resource "tailscale_tailnet_key" "tailscale_key" {
        id            = "kz3rXtEF1521CNTRL"
      - key           = (sensitive value) -> null
        tags          = [
            "tag:web-ingress",
        ]
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
        id                      = "9013"
        name                    = "debian13"
        tags                    = [
            "debian",
            "template",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

      + serial_device {
          + device = "socket"
        }

        # (5 unchanged blocks hidden)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
        id                      = "8022"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (29 unchanged attributes hidden)

      + serial_device {
          + device = "socket"
        }

        # (5 unchanged blocks hidden)
    }

  # module.vm_minimal_config.module.cloud_init_files.proxmox_virtual_environment_file.ci_user_data[0] must be replaced
-/+ resource "proxmox_virtual_environment_file" "ci_user_data" {
      + file_modification_date = (known after apply)
      ~ file_name              = "d780b7f5421df0de.user-data.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/d780b7f5421df0de.user-data.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
          ~ file_name = "d780b7f5421df0de.user-data.yaml" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.vm_minimal_config.module.cloud_init_files.random_id.random_id must be replaced
-/+ resource "random_id" "random_id" {
      ~ b64_std     = "14C39UId8N4=" -> (known after apply)
      ~ b64_url     = "14C39UId8N4" -> (known after apply)
      ~ dec         = "15528613779177599198" -> (known after apply)
      ~ hex         = "d780b7f5421df0de" -> (known after apply)
      ~ id          = "14C39UId8N4" -> (known after apply)
      ~ keepers     = { # forces replacement
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "combined_ci_hash"                    = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "short_ci_user_data_contents_hash"    = (sensitive value)
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 2 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-45-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->